In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# check for null using isnull()
revenue_series = Series([100, 200, 300, np.nan], index=['Audi', 'Mercedes', 'BMW', 'Toyota'])
print(revenue_series)

Audi        100.0
Mercedes    200.0
BMW         300.0
Toyota        NaN
dtype: float64

In [3]:
revenue_series.isnull()

Audi        False
Mercedes    False
BMW         False
Toyota       True
dtype: bool

In [5]:
# Series - dropna() - drops the nan from the series
revenue_series.dropna()

Audi        100.0
Mercedes    200.0
BMW         300.0
dtype: float64

In [9]:
# DataFrame - dropna()
df1 = DataFrame(np.random.randn(12).reshape(4,3))
print(df1)

          0         1         2
0 -1.030131 -0.111634  1.628653
1 -1.589688 -0.532610  0.453720
2 -2.833993  0.526979 -0.971113
3 -0.140833 -0.439116  0.114530

In [10]:
df1.loc[1,2] = np.nan #loc - used to select individual elements from the DataFrame
df1.loc[2,1] = np.nan
df1.loc[3,] = np.nan
print(df1)

          0         1         2
0 -1.030131 -0.111634  1.628653
1 -1.589688 -0.532610       NaN
2 -2.833993       NaN -0.971113
3       NaN       NaN       NaN

In [13]:
df1.dropna()

          0         1         2
0 -1.030131 -0.111634  1.628653

In [14]:
# disadvantages of dropping all NAN values in dataframe : drops the entire row or column even if a single element is having NaN value

In [15]:
# using dropna() efficiently - how parameter
df1.dropna(how="all") # drops the row only if all the values are nan

          0         1         2
0 -1.030131 -0.111634  1.628653
1 -1.589688 -0.532610       NaN
2 -2.833993       NaN -0.971113

In [16]:
# using dropna() along column (DataFrame)
df1.dropna(axis=1) # axis=1 for column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [18]:
#dropna with thresh parameter
df2 = DataFrame([
    [1,2,3,np.nan],
    [4,5,6,7],
    [8,9,np.nan,np.nan],
    [12,np.nan,np.nan,np.nan]
])
print(df2)

    0    1    2    3
0   1  2.0  3.0  NaN
1   4  5.0  6.0  7.0
2   8  9.0  NaN  NaN
3  12  NaN  NaN  NaN

In [22]:
df2.dropna(thresh=3) #thresh = 3, means if 3 for more values present other than nan then the row should exist

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0

In [23]:
df2.dropna(thresh=2)

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0
2  8  9.0  NaN  NaN

In [25]:
# fillna() function
df2.fillna(0) # fills nan values with 0

    0    1    2    3
0   1  2.0  3.0  0.0
1   4  5.0  6.0  7.0
2   8  9.0  0.0  0.0
3  12  0.0  0.0  0.0

In [26]:
#filling each column's nan values with different values
df2.fillna({0:0, 1:50,2:100,3:200})

    0     1      2      3
0   1   2.0    3.0  200.0
1   4   5.0    6.0    7.0
2   8   9.0  100.0  200.0
3  12  50.0  100.0  200.0